# тесты проектов (CRUD, участники, роли).

# Создание проекта (успех, проверка, что создатель стал админом).

# Получение списка проектов, где пользователь админ (/projects).

# Получение всех проектов пользователя (/projects/all).

# Получение информации о конкретном проекте (с участниками) – доступ только для участников.

# Обновление проекта (только админ, проверка, что нельзя обновить чужой проект).

# Удаление проекта (только админ).

# Добавление участника (только админ, нельзя добавить уже существующего, нельзя добавить несуществующего).

# Удаление участника (только админ, нельзя удалить последнего админа, нельзя удалить себя, если ты единственный админ).

# Смена роли участника (только админ, нельзя снять последнего админа, нельзя изменить свою роль).